/**
 * Copyright (C) 2018 Rebo, All rights reserved.
 * @file    music_rhythm_app.h
 * @brief   
 */
#ifndef MUSIC_RHYTHM_APP_H
#define MUSIC_RHYTHM_APP_H
/*******************************************************************************
 *    INCLUDED FILES
 ******************************************************************************/
#include "std_types.h"


/*******************************************************************************
 *    MACRO DEFINITIONS
 ******************************************************************************/

/*******************************************************************************
 *    TYPEDEF TYPES
 ******************************************************************************/

/*******************************************************************************
 *    CONSTANT VARIABLES DECLARATIONS
 ******************************************************************************/

/*******************************************************************************
 *    GLOBAL VARIABLES DECLARATIONS
 ******************************************************************************/


/*******************************************************************************
 *    GLOBAL FUNCTION DECLARATIONS
 ******************************************************************************/
#ifdef __cplusplus
extern "C"
{
#endif

    /**
     * @brief  音乐律动应用任务初始化
     * @retval STD_E_OK    - 初始化成功
     * @retval STD_E_NOT_OK - 初始化失败
     */
    std_rtn_type music_rhythm_app_task_init(void);

    /**
     * @brief  音乐律动应用主任务
     *         从LIN总线获取频率数据，解析音乐频谱并生成灯光效果
     * @param  无
     * @retval 无
     */
    void music_rhythm_app_task(void);    
    
#ifdef __cplusplus
}
#endif
#endif
